---
kind: type
id: T:Autodesk.Revit.DB.Mechanical.FlexDuctType
source: html/cd9a7d63-9b1b-921f-f3ec-b2ec862eb2f2.htm
---
# Autodesk.Revit.DB.Mechanical.FlexDuctType

A flex duct type in the Autodesk Revit MEP product.

## Syntax (C#)
```csharp
public class FlexDuctType : MEPCurveType
```

## Remarks
The flex duct type is only available in the Autodesk Revit MEP product.